Revit 2027 API
ElectricalAnalyticalNode.DisconnectFromUpstreamNode Method
 Disconnects from upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisconnectFromUpstreamNode(
	ElementId upstreamNodeId
)
Public Sub DisconnectFromUpstreamNode (
	upstreamNodeId As ElementId
)
public:
void DisconnectFromUpstreamNode(
	ElementId^ upstreamNodeId
)
member DisconnectFromUpstreamNode :
        upstreamNodeId : ElementId -> unit
Parameters
upstreamNodeId ElementId
 The upstream node id to disconnect from.
Exceptions
Exception | Condition
ArgumentException |  The id is not an analytical distribution node id. -or- The analytical distribution node can not disconnect from the upstream node.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace